data/NASA_2DWMH/0/tauij_LES
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      tauij_LES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
15600
(
(0.0044490643759523205 -4.5660155554708715e-05 0.0 1.300793465349086e-05 0.0 0.002845651413521849) 
(0.004556212653393906 -0.00019323119008169098 0.0 1.923384664855621e-05 0.0 0.002992200853010623) 
(0.0013402576236823456 -0.0001910320657422279 0.0 2.896146069508349e-05 0.0 0.0010577471878301763) 
(0.00042962305614665933 -0.00013696641674463764 0.0 4.488426001069165e-05 0.0 0.00039577520628840336) 
(0.0005990407241070262 -0.0003107434732480642 0.0 0.00016314956707515492 0.0 0.0005439948973397378) 
(0.0008831808597242357 -0.0005789570211142838 0.0 0.0003822695027119486 0.0 0.0008459728969777567) 
(0.0007617652816042827 -0.0005607617154885385 0.0 0.00041472457201468003 0.0 0.0007882371014150813) 
(0.0004402516248927388 -0.0003590017492078484 0.0 0.0002936474390189 0.0 0.0004830711964110569) 
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           nonuniform List<symmTensor> 
120
(
(6.66528963183349e-16 -1.51180245418276e-17 8.34336500788192e-36 6.66758447641204e-16 3.31564606075921e-37 6.66666666666667e-16)
(6.65894607390132e-16 -1.80372974021747e-17 8.94940413337194e-36 6.6763709711887e-16 6.83534843729026e-34 6.66666666666667e-16)
(6.6459726130828e-16 -1.01516526353867e-17 6.14806650884635e-35 6.69320147200529e-16 -7.76488028596166e-36 6.66666666666667e-16)
(6.6880093830561e-16 2.8040890799247e-18 2.7612324443915e-33 6.65628921445503e-16 4.9889695424764e-33 6.66666666666667e-16)
(6.72656965679406e-16 4.96109277995281e-18 1.74502406108647e-33 6.61312124902201e-16 -8.30412439381543e-34 6.66666666666667e-16)
(6.71425913988919e-16 2.42958324410874e-18 6.27618321605435e-35 6.62137532078946e-16 -3.90658455175434e-35 6.66666666666667e-16)
(6.69761115300153e-16 1.04635493424083e-18 5.86080159838234e-33 6.63677085086644e-16 8.10397384179608e-33 6.66666666666667e-16)
(6.6908214011313e-16 5.82555243823655e-19 2.06529594144718e-32 6.64338986093412e-16 -3.01495505723908e-32 6.66666666666667e-16)
...
)
;
    }
    topWall
    {
        type            fixedValue;
        value           nonuniform List<symmTensor> 
120
(
(6.66667409046812e-16 2.40435458921322e-17 -0 6.66665326514138e-16 -0 6.66666666666667e-16)
(6.66668360236388e-16 2.40205688117583e-17 -0 6.6666503050727e-16 -0 6.66666666666667e-16)
(6.66669222388835e-16 2.39808057576978e-17 -0 6.66664775339747e-16 -0 6.66666666666667e-16)
(6.66669997198161e-16 2.39258919883957e-17 -0 6.66664556969118e-16 -0 6.66666666666667e-16)
(6.66670699738101e-16 2.38574276727999e-17 -0 6.66664372256907e-16 -0 6.66666666666667e-16)
(6.66671335766739e-16 2.37764896920264e-17 -0 6.66664215873391e-16 -0 6.66666666666667e-16)
(6.66671889425611e-16 2.36844647943669e-17 -0 6.66664088660611e-16 -0 6.66666666666667e-16)
(6.66672349359981e-16 2.35830172270459e-17 -0 6.66663996420684e-16 -0 6.66666666666667e-16)
...
)
;
    }
    inlet_half0
    {
        type            cyclic;
    }
    inlet_half1
    {
        type            cyclic;
    }
    outlet_half0
    {
        type            cyclic;
    }
    outlet_half1
    {
        type            cyclic;
    }
    sideRight_half0
    {
        type            empty;
    }
    sideRight_half1
    {
        type            empty;
    }
    sideLeft_half0
    {
        type            empty;
    }
    sideLeft_half1
    {
        type            empty;
    }
}


// ************************************************************************* //
