data/NASA_2DWMH/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out surface files with interpolated field data in VTK format, e.g.
    cutting planes, iso-surfaces and patch boundary surfaces.

    This file includes a selection of example surfaces, each of which the user
    should configure and/or remove.

\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// ************************************************************************* //

actions
(
    {
        name wallFaceSet;   // Name of the faceSet
        type faceSet;     // Type of set
        action new;       // Create a new faceSet
        source patchToFace;
        sourceInfo
        {
          name bottomWall;
        }
     }
);
// ************************************************************************* //
